[
  {
    "review_id": "bc7ef4d4a1f54bbb",
    "paper_id": "ACL_2017_338",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "- The related work is quite thorough and the comparison with the approach presented in this paper makes the hypothesis of the paper stronger. The evaluation section is also extensive and thus, the experiments are convincing.",
    "weaknesses": "- In Section 3 it is not clear what is exactly the dataset that you used for training the SVM and your own model. Furthermore, you only give the starting date for collecting the testing data, but there is no other information related to the size of the dataset or the time frame when the data was collected. This might also give some insight for the results and statistics given in Section 3.2. \n     - In Table 3 we can see that the number of reviewers is only slightly lower than the number of reviews posted (at least for hotels), which means that only a few reviewers posted more than one review, in the labeled dataset. How does this compare with the full dataset in Table 2? What is the exact number of reviewers in Table 2 (to know what is the percentage of labeled reviewers)? It is also interesting to know how many reviews are made by one person on average. \nIf there are only a few reviewers that post more than one review (i.e., not that much info to learn from), the results would benefit from a thorough discussion.",
    "comments": "This paper focuses on identifying spam reviews under the assumption that we deal with a cold-start problem, i.e., we do not have enough information to draw a conclusion. The paper proposes a neural network model that learns how to represent new reviews by jointly using embedded textual information and behaviour information. Overall, the paper is very well written and the results are compelling.\n- Typos and/or grammar:                                       - The new reviewer only provide us                                              - Jindal and Liu (2008) make the first step -> the work is quite old, you could use past tense to refer to it      - Usage of short form “can’t”, “couldn’t”, “what’s” instead of the prefered long form      - The following sentence is not clear and should be rephrased: “The new reviewer just posted one review and we have to filter it out immediately, there is not any historical reviews provided to us.“",
    "overall_score": "4",
    "confidence": "4"
  },
  {
    "review_id": "dc094f6a17573512",
    "paper_id": "ACL_2017_338",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "The paper is well organized and clearly written. The idea of jointly encoding texts and behaviors is interesting. The cold-start problem is actually an urgent problem to several online review analysis applications. In my knowledge, the previous work has not yet attempted to tackle this problem. This paper is meaningful and presents a reasonable analysis. And the results of the proposed model can also be available for downstream detection models.",
    "weaknesses": "In experiments, the author set the window width of the filters in the CNN module to 2. Did the author try other window widths, for example width `1' to extract unigram features, `3' to trigram, or use them together? \nThe authors may add more details about the previous work in the related work section. More specifically description would help the readers to understand the task clearly.\nThere are also some typos to be corrected: Sec 1: ``...making purchase decision...'' should be ``making a/the purchase decision'' Sec 1: ``...are devoted to explore... '' should be `` are devoted to exploring'' Sec 1: ``...there is on sufficient behaviors...'' should be “there are no sufficient behaviors'' Sec 1: ``...on business trip...'' should be ``on a business trip'' Sec 1: ``...there are abundant behavior information...'' should be ``there is abundant behavior'' Sec 3: ``The new reviewer only provide us...'' should be ``...The new reviewer only provides us...'' Sec 3: ``...features need not to take much...'' should be ``...features need not take much...'' Sec 4: ``...there is not any historical reviews...'' should be ``...there are not any historical reviews...'' Sec 4: ``...utilizing a embedding learning model...'' should be ``...utilizing an embedding learning model...'' Sec 5.2 ``...The experiment results proves...'' should be ``...The experiment results prove...''",
    "comments": "It is a good paper and should be accepted by ACL.",
    "overall_score": "5",
    "confidence": "5"
  }
]