[
  {
    "review_id": "5161130c7a6544c3",
    "paper_id": "ACL_2017_371",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "The  idea to incorporate phrasal information into the task is interesting.",
    "weaknesses": "- The description is hard to follow. Proof-reading by an English native speaker would benefit the understanding - The evaluation of the approach has several weaknesses",
    "comments": "- In Equation 1 and 2 the authors mention a phrase representation give a fix-length word embedding vector. But this is not used in the model. The representation is generated based on an RNN. What the propose of this description?\n- Why are you using GRU for the Pyramid and LSTM for the sequential part? Is the combination of two architectures a reason for your improvements?\n- What is the simplified version of the GRU? Why is it performing better? How is it performing on the large data set?\n- What is the difference between RNNsearch (groundhog) and RNNsearch(baseline) in Table 4?\n-  What is the motivation for only using the ending phrases and e.g. not using the starting phrases?\n- Did you use only the pyramid encoder? How is it performing? That would be a more fair comparison since it normally helps to make the model more complex.\n- Why did you run RNNsearch several times, but PBNMT only once?\n- Section 5.2: What is the intent of this section",
    "overall_score": "2",
    "confidence": "4"
  },
  {
    "review_id": "09a87b6eb2dda3cd",
    "paper_id": "ACL_2017_371",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "==== A new phrasal architecture.",
    "weaknesses": "==== **Technical**:  It's unclear whether there is a limit set  on the phrase length of the pRNN. \nMaybe I've missed this in the paper, if there is, please be more explicit about it because it affects the model quite drastically if for every sentence the largest phrase length is the sentence length.   - It's because if the largest phrase length is the sentence length, then model can be simplified into a some sort of convolution RNN where the each state of the RNN goes through some convolution layer before a final softmax and attention.   - If there is a limit set on the phrase length of pRNN, then it makes the system more tractable. But that would also mean that the phrases are determined by token ngrams which produces a sliding window of the \"pyramid encoders\" for each sentence where there are instance where the parameter for these phrases will be set close to zero to disable the phrases and these phrases would be a good intrinsic evaluation of the pRNN in addition to evaluating it purely on perplexity and BLEU extrinsically.  The usage of attention mechanism without some sort of pruning might be problematic at the phrasal level. The author have opted for some sort of greedy pruning as described in the caption of figure 4. But I support given a fixed set of phrase pairs at train time, the attention mechanism at the phrasal level can be pre-computed but at inference (apply the attention on new data at test time), this might be kind of problematic when the architecture is scaled to a larger dataset.  **Empirical**:  One issue with the language modelling experiment is the choice of evaluation and train set. Possibly a dataset like common crawl or enwiki8 would be more appropriate for language modelling experiments.  The main issue of the paper is in the experiments and results reporting, it needs quite a bit of reworking.   - The evaluation on PTB (table 2) isn't a fair one since the model was trained on a larger corpus (FBIS) and then tested on PTB. The fact that the previous study reported a 126 perplexity baseline using LSTM and the LSTM's perplexity of 106.9 provided by the author showed that the FBIS gives an advantage to computing the language model's perplexity when tested on PTB.\n - Also, regarding section 3.3, please cite appropriate publications the \"previous work\" presented in the tables. And are the previous work using the same training set?  - Additionally, why isn't the the GRU version of pRNNv reported in the FBIS evaluation in Table 3?\nThe result section cannot be simply presenting a table without explanation:  - Still on the result sections, although it's clear that BLEU and perplexity are objective automatic measure to evaluate the new architecture. It's not really okay to put up the tables and show the perplexity and BLEU scores without some explanation. E.g. in Table 2, it's necessary to explain why the LSTM's perplexity from previous work is higher than the author's implementation. Same in Table 3.  The result presented in Table 4 don't match the description in Section 4.3:  - It's not true that the pRNN outperforms both PBSMT and Enc-Dec model. The authors should make it clear that on different evaluation sets, the scores differs. And it's the averaged test scores that pRNN performs better - Please also make it clear whether the \"Test Avg.\" is a micro-average (all testsets are concatenated and evaluated as one set) or macro-average (average taken across the scores of individual test sets) score.  For table 4, please also include the significance of the BLEU improvement made by the pRNN with respect to the the baseline, see https://github.com/jhclark/multeval",
    "comments": "",
    "overall_score": "2",
    "confidence": "3"
  }
]