{
  "paper_id": "COLING_2020_76",
  "title": "Variation in Coreference Strategies across Genres and Production Media",
  "conference": "COLING",
  "domain": {
    "research_object": "不同体裁和媒介中指代消解策略的变化与差异",
    "core_technique": "对文本中的指代消解策略进行跨体裁和媒介的比较分析",
    "application": "提升自然语言处理系统在多样文本环境下的指代理解能力",
    "domains": [
      "计算语言学",
      "自然语言处理"
    ]
  },
  "ideal": {
    "core_idea": "分析不同体裁和媒介下指代策略的变化及其测量方法问题",
    "tech_stack": [
      "语料库分析",
      "指代链统计",
      "跨体裁比较"
    ],
    "input_type": "文本语料（不同体裁和媒介）",
    "output_type": "指代策略变化的定量与定性分析"
  },
  "skeleton": {
    "problem_framing": "论文通过回顾已有关于指称表达策略在口语与书面语中的研究，指出该领域的研究结果尚无定论，部分结论甚至相互矛盾。作者以此为切入点，强调该问题的重要性和研究的必要性。",
    "gap_pattern": "作者批评现有研究主要存在两个不足：一是共指链属性的测量方式不透明，二是所用数据差异较大，导致研究难以比较。这种批评方式明确指出了领域内的研究空白和改进空间。",
    "method_story": "作者提出将通过细致的语料库对比分析来研究口语与书面语中的共指现象，并强调将明确公开具体的测量方法，以提升研究的透明度和可复现性。",
    "experiments_story": "实验部分聚焦于对比分析不同媒介（尤其是微博等微型博客）的数据，旨在通过实证数据揭示口语与书面语在共指表达上的异同，实验设计紧扣研究目标并结合新兴媒介。"
  },
  "tricks": [
    {
      "name": "明确研究目标",
      "type": "writing-level",
      "purpose": "突出研究的主旨和方向",
      "location": "Our primary goal here is to shed light on coreference with respect to the spoken/written distinction, by undertaking a careful comparative corpus analysis and explicitly stating our methods of measurement. The secondary goal is to explore how the medium microblog, specifically Twitter, relates to the spokenwritten spectrum for coreference strategies.",
      "description": "在论文开头明确陈述主要和次要研究目标，有助于读者理解研究的核心问题和研究范围。"
    },
    {
      "name": "批判性文献综述",
      "type": "writing-level",
      "purpose": "展示对前人工作的理解及研究空白",
      "location": "Research on strategies for producing referring expressions has often investigated the differences (if any) between spoken and written language, but as we will show in Section 2, results have been inconclusive. Sometimes, claims are simply contradictory, but the more important problem is that usually, the exact ways of measuring the properties of coreference chains are not being made transparent.",
      "description": "在引言部分批判性地回顾已有研究，指出已有结论的不一致和方法透明度不足，突出本研究的创新点和必要性。"
    },
    {
      "name": "方法透明化",
      "type": "method-level",
      "purpose": "提升研究的可重复性和科学性",
      "location": "by undertaking a careful comparative corpus analysis and explicitly stating our methods of measurement",
      "description": "明确指出将详细公开测量方法，强调方法透明性，便于他人复现和比较结果。"
    },
    {
      "name": "对比实验设计",
      "type": "experiment-level",
      "purpose": "突出不同数据集或条件下的差异",
      "location": "we used an out-of-the-box contemporary coreference resolver (Lee et al., 2018), set to coarse-to-fine inference, and obtained an F1 score of 72.6% on the standard OntoNotes test data (Pradhan et al., 2013), and in contrast a score of only 45.2% on the corpus of Twitter conversations.",
      "description": "通过在标准数据集和推特语料上对比实验结果，突出研究对象（如推特）在现有方法下的特殊性和挑战。"
    },
    {
      "name": "数据多样性与可比性讨论",
      "type": "writing-level",
      "purpose": "提醒读者注意数据差异对结果的影响",
      "location": "the data that has been used can vary considerably, and it is not always clear how studies can be compared.",
      "description": "强调不同研究使用的数据集差异及其对结果对比的影响，为后续方法选择和实验设计提供合理性。"
    },
    {
      "name": "引入新领域/新数据类型",
      "type": "writing-level",
      "purpose": "拓展研究领域，增加创新性",
      "location": "The secondary goal is to explore how the medium microblog, specifically Twitter, relates to the spokenwritten spectrum for coreference strategies.",
      "description": "将研究对象扩展到较少被关注的新领域（如推特），展现创新性和前沿性。"
    },
    {
      "name": "引用前沿工具与基线",
      "type": "method-level",
      "purpose": "确保实验具有代表性和可比性",
      "location": "we used an out-of-the-box contemporary coreference resolver (Lee et al., 2018), set to coarse-to-fine inference",
      "description": "选用当前先进的工具作为实验基线，便于与其他研究对比，并确保实验结果的有效性。"
    },
    {
      "name": "用具体实验指标量化对比",
      "type": "experiment-level",
      "purpose": "便于客观评价方法效果",
      "location": "obtained an F1 score of 72.6% on the standard OntoNotes test data (Pradhan et al., 2013), and in contrast a score of only 45.2% on the corpus of Twitter conversations.",
      "description": "使用F1分数等具体量化指标展示不同数据集上的性能差异，使得结果更具说服力和可比性。"
    },
    {
      "name": "提出领域特有问题",
      "type": "writing-level",
      "purpose": "为后续深入研究打基础",
      "location": "Aktaş et al. (2018) outlined peculiar anaphoric cases in Twitter conversations, such as exophoric references to non-linguistic",
      "description": "结合前人研究，指出推特语料中存在特有的指代现象，为后续深入分析和方法改进提供依据。"
    }
  ]
}