[
  {
    "review_id": "a463596b6558bea9",
    "paper_id": "COLING_2020_29",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "",
    "weaknesses": "",
    "comments": "This paper proposes a rule-based system to convert from STREUSLE (Supersense-Tagged Repository of English with a Unified Semantics for Lexical Expressions\"), a shallow(er) meaning representation (based on syntax and lexical semantic units) into UCCA (\"Universal Conceptual Cognitive\"), a document-level meaning representation framework. In addition, supervised parsers are trained, which incorporate syntactic and lexical semantics features. The authors also perform an analysis of the similarities and differences of the two approaches. \nThis research builds further upon the UD-to-UCCA converter of Herschcovich et al. (2019a).\nComments: - The paper is addressing an interesting topic, as the authors contribute with their research to evaluate how different frameworks represent meaning in text. \nOf course, the analysis is somehow indirect, as the authors apply two different approaches, a rule-based and data-driven (supervised) approach to convert STREUSLE into UCCA representations.\n- The authors come across various difficult linguistic issues, which are well-known in NLP research, such as noun compound interpretation. \nGiven the complexity of the task, the obtained results are reasonable.\n- Although this paper presents an interesting contribution to the field, I feel the content is unbalanced between the introduction+related research and the novel research proposed by the authors. I fully understand this topics requires an extensive introduction about STREUSLE and UCCA before the own research can be explained, but now a lot of interesting information (e.g. details and examples for the rules implemented) is included in the supplementary material because of lack of space in the actual paper. It is clear from the supplementary material and programming code that a substantial amount of work has been performed for this research, but this is not sufficiently clear when reading the paper. \nMaybe this research is better suited for a journal paper, where the authors have more space to elaborate on the approach and evaluation?\n- In the current approach, the parser now has access to syntactic features derived from gold UD annotations. What would be the expected drop in performance when automatically predicted features (with a UD parser and STREUSLE tagger) would be used? Did you perform such experiments?\n- I have some doubts about the approach being language independent, as stated by the authors. Although this might be the case on a conceptual level, I see some practical issues when implementing the rules for different languages.",
    "overall_score": "3",
    "confidence": "2"
  }
]