[
  {
    "review_id": "5d50c22342110fb4",
    "paper_id": "COLING_2020_30",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "*The corpus, though small, is very useful for the NLP community, as empathy annotated corpora are not really available. I also agree with the limitations mentioned by the authors about existing empathy labeled corpora.\n- I appreciate the decision to mark spans of text while marking for empathy, and also the decision to independently label cognitive and emotional empathy.\n- The paper is very clearly written, and very easy to follow for most parts.",
    "weaknesses": "- The primary weakness of this paper, in my opinion, is the presentation - not the language, rather the content and substance. Being a 9 page full-paper, you had plenty of space to squeeze in a lot of information (I mention below some crucially missing points, and some good to have points). Yet, the paper has a lot of repetitive information which took too much of the space which could have been useful. I would have suggested to write a short paper, but I do think you have enough things to discuss. But let me first point out the repetitions: *Figure 1, the paragraph preceding it, the last paragraph of section 1, all talks of exactly the same thing.  - Table 3 and the paragraph around it essentially describe the same values.\n- What is the significance of Figure 2? What does the arrow mean? \n*Definition of empathy has been stated multiple times. \nand so on.\n*On the other hand, there are many important information which I could not find in the paper: - How exactly was the annotation for strength and weakness done?\n- how were the annotators trained?  - What is the background of the annotators?\n- the disagreement analysis is not very insightful. It just emphasizes that there is agreement, which we already know from Table 3. What would be interesting is to point out specific cases where annotators disagree and then reason it out: whether it was a mistake on part of one of the annotators, or was it due to underspecification or misinterpretation of the guidelines and so on.\n- Some parameters were not explained. Why did you choose to do the analysis on 92 instances? Why only 500 examples were annotated?  - it would have been tremendously helpful to show examples (not necessarily taken from data) for all the 5 categories of cognitive and emotional empathy. For instance, I could not understand the difference between label 1 and 2 for cognitive empathy.  - It is not clear if the authors have come up with the description of these labels themselves or is it based on previous work (you say inspired by, but that doesn't mean \"adopted from\", hence the confusion).\n*There are also a few technical issues that I am not quite convinced about: - The emotional empathy labels, as described in Table 2, seemed more like \"linguistic politeness\" levels to me (such as the use of modal verbs, hedging, etc.). How would you distinguish between politeness and empathy? Or are they inherently correlated?\n- Table 1, score 5 - \"she completely stepped out of her perspective\" - how would an annotator know the perspective of the writer, unless one mentions it in the review itself?  - What was the correlation between \"strength\"/\"weakness\" annotations and empathy scores, if any? I would imagine if a review points primarily to weaknesses, it will also be probably low on emotional empathy, because according to your definition of score-5, it should use words like \"excellent\" or similar positive adjectives. Yet, I can imagine a review pointing to a lot of weaknesses, yet being very empathetic. How does this interaction play out in your annotations, and how did you train annotators recognize empathetic negative reviews?  Some typos and minor",
    "comments": "",
    "overall_score": "3",
    "confidence": "4"
  },
  {
    "review_id": "ca503ea7387185ba",
    "paper_id": "COLING_2020_30",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "",
    "weaknesses": "and 3) suggestions for improvements (to answer...\" -> So you spot those areas in the review and label them? But what if it is not so easy? I mean 1-3 can be mixed up, would you then label 1-3 multiple times?\n3.2.2: - Do you provide the empathy level per review component? What if (as I mentioned above) the same review component, such as \"weakness\" would occur multiple times, do you then give one overall empathy level per \"weakness\" or for each single one? Also empathy level on sentence level might be interesting as well.\n4.2: - Interesting analysis!  References: -> some references have errors, please check. here some examples: - Emotion Representation Mapping for Automatic Lexicon Construction (Mostly) Performs on Human Level -> venue missing - \"University of New . . .\"\n- \"Introduction to Reasoning.\" - > where was this published?",
    "comments": "",
    "overall_score": "3",
    "confidence": "3"
  }
]