[
  {
    "review_id": "38b01bf237916094",
    "paper_id": "COLING_2020_27",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "",
    "weaknesses": "",
    "comments": "This paper describes a multi-faceted project to provide tools to support a range of indigenous languages spoken across Canada. The paper is not analytical but rather descriptive of the various tools that have been implemented so far.  The paper is well-written and clear, and provides a nice overview of the work that has been done. There are no particularly innovative or novel solutions developed or applied. Would make a good poster.\nIn my view, the paper would have benefited from a few examples of the linguistic phenomena that are described (e.g. subsets of verb conjugations).",
    "overall_score": "3",
    "confidence": "3"
  },
  {
    "review_id": "49245c740a56bc76",
    "paper_id": "COLING_2020_27",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "",
    "weaknesses": "",
    "comments": "This is a highly satisfying paper. It is a report of various NLP efforts for several Indigenous languages of Canada It goes deeply enough into the technical details of the projects to show that the efforts are viable and successful, without getting bogged down in numbers or linguistic details that are unimportant to people external to the projects. Where the paper does get technical is in a discussion of the differing difficulties of speech recognition for different languages, providing a useful case study to demonstrate that one-size technology approaches are not necessarily universal stand-alone solutions.\nThe paper understates two points that could be further investigated.  1 \"Rule based approaches may seem outdated in contrast to statistical or neural methods. However, with most Indigenous languages, existing corpora are not large enough to produce accurate statistical models.\" Why apologize for using a better approach? Rules may be \"outdated\" because they are inefficient for certain languages with reams of available data and scads of phenomena that don't fit. For polysynthetic languages, though, one could posit that a fairly small set of rules might be highly predictive - humans invoke algorithms to construct patterned speech that would otherwise be incomprehensible for the listener to deconstruct, and those same algorithms can be encoded for use by machines. At the least, it would be worth proposing that the languages in this study can offer a test of rule-based vs. inference-based processes, and propose performing such comparisons when the data for the study languages is sufficiently mature.\n2. This paper shows remarkable achievement for minority languages as a result of a $6 million grant. This is a crucial scientific finding: money works! Important research can make great strides regarding languages that are usually neglected, if and only if funding is available for people to take the time to do the work. The billions that have been pumped into languages like English have in fact resulted in technologies that can be applied at much lower cost to languages like Kanyen’kéha, but there are still costs. The paper could make more of an advocacy point for what relatively modest funding could do for languages in places where leaders have not yet had the same impetuses as witnessed in Canada, including India and Africa where \"minority\" language is often a misnomer.\nThe paper nicely shows what can be done for languages well outside of the research mainstream, particularly in collaboration between the researchers and the communities. Without a doubt, this paper should be part of the program.",
    "overall_score": "5",
    "confidence": "5"
  },
  {
    "review_id": "14f9ba21b06454da",
    "paper_id": "COLING_2020_27",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "",
    "weaknesses": "",
    "comments": "The paper describes the first phase of the Indigenous language project in Canada. The paper is very well-written and easy to follow. And the project is fascinating! I am quite impressed by the scale at which the authors have worked across so many technologies and so many languages. I wish there were more projects like this. Really well done. \nI think while the paper is very informative, for Coling audience, it might be probably more interesting as well as important to know about high level takeaways from this project. For instance, I would loved to know: a) what were some of the top challenges - scientific, linguistic, administrative, political and logistic - that you faced during this project?\nb) what were some of the strategies that you tried to overcome these challenges, and which ones worked the best?\nc) Which of these technologies have been deployed? Who are using them? What is the impact - socially and/or economically?\nd) What challenges have you faced/do you foresee in deployment or adoption of some of these technologies?\ne) What would be some of your recommendations on which technologies one should focus on while helping the indigenous communities? How should these decisions be made? What role does the speaker communities have to play in this decision making?\nand so on.\nI believe with your profound experience and expertise, you could really inform the readers about these questions. On the other hand the process of building the technologies, while useful to learn from, are mostly known to this community and probably can be described in a table where you list the language, the technologies you built, accuracy indicators and any other remark on approach used etc.\nSome specific comments: - You mention that many indigenous languages do not have a script. For those, TTS (and ASR) could be built using the following approach:  'Text to Speech in New Languages without a Standardized Orthography', Sunayana Sitaram , Gopala Anumanchipalli, Justin Chiu, Alok Parlikar and Alan W Black, SSW 8 (2013), Barcelona, Spain - You could consider PrathamBooks and their Storyweaver platform for crowdsourced creation of indigenous stories and books, whenever there is a script. https://storyweaver.org.in/prathambooks - It is unclear to me why a polysynthetic language will be difficult to teach. It is possible that the way syncretic languages are taught - that methodology may not be effective for polysynthetic languages. However, there might be other teaching methodologies that works.",
    "overall_score": "4",
    "confidence": "4"
  }
]