[
  {
    "review_id": "c9e07574b08c7c4d",
    "paper_id": "ARR_2022_57",
    "reviewer": null,
    "paper_summary": "See my previous summary.\nAfter reading the authors' response, most questions and concerns are addressed.  The remaining concern I have is the instability of major PLMs (e.g., https://openreview.net/forum?id=nzpLWnVAyah), where PLMs are very sensitive to hyper-parameters both in pre-training and fine-tuning. \nThis paper explores language abilities of PLM(s), but each PLM is based on a single hyper-parameter configuration (learning rate, batch size, number of updates etc.). Considering the instability of PLMs, my concern is that the findings of this paper might not be supported when we use different hyper-parameters (e.g., using different random seeds, learning rates, batch sizes).  It would be great to mention this phenomenon/possibility in the paper. ",
    "strengths": "see above ",
    "weaknesses": "see above ",
    "comments": "I appreciate authors' response. I raised my score. ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  },
  {
    "review_id": "25d81c5100d51b1e",
    "paper_id": "ARR_2022_57",
    "reviewer": "Thang Vu",
    "paper_summary": "I reviewed this paper in September. Since the authors did not update their paper, my comments and scores for this paper stay unchanged. ",
    "strengths": "See review in Sept. ",
    "weaknesses": "See review in Sept. ",
    "comments": "See review in Sept. ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  }
]