[
  {
    "review_id": "5055d6e9bee3c38f",
    "paper_id": "ARR_2022_198",
    "reviewer": null,
    "paper_summary": "The paper presents the first results on time expression grounding, which aims at define a specific period of the day for each time expression like \"morning\", \"night\" etc. The authors experiment with 28 languages and apply language agnostic methods. The results are promising and might be potentially useful for natural language understanding tasks. ",
    "strengths": "Strengths of the paper: - interesting problem definition - clear methodology - acceptable results - thorough analysis of data - experiments on multiple languages - potentially useful task for higher-level applications (e.g. dialogue systems) ",
    "weaknesses": "Weaknesses of the paper: - results could have been discussed in more detail - some factors like time zones could have also been considered when selecting data ",
    "comments": "1. Do you think that the location of a country within the time zone affects the results? If a country is located at the westernmost part of a specific time zone, there might be more than one hour difference between the sunrise/sunset with regard to the easternmost part. \n2. Have you thought of visualizing the data on a map? This might be helpful for discovering some patterns in the data. ",
    "overall_score": "3.5 ",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  },
  {
    "review_id": "c6f5a1420bf8d684",
    "paper_id": "ARR_2022_198",
    "reviewer": "Beatrice Savoldi",
    "paper_summary": "This paper concerns the task of temporal grounding, which is framed as the mapping of temporal expressions (morning, noon, afternoon, evening, night) to their start and end time hours in the day in different languages (and cultures). To achieve such a mapping,  different approaches are proposed: a) a corpus-based approach where start and end time are (indirectly) inferred from the distribution of time references in Wikipedia data; b) two language-model (LM) methods where start and time can be either i) directly predicted by multilingual BERT, or ii) indirectly estimated from the predictions of multilingual BERT. Such methods are evaluated against newly created gold standard temporal annotations for 4 languages (Italian, Hindi, English and Portuguese). Additionally, the most successful extractive corpus-based method is tested on other  (although unlabeled) 24 languages. The paper also includes several discussions on cultural/temporal differences across languages and additional analyses on the proposed methods. ",
    "strengths": "The paper contributes to a niche of research by proposing an interesting take on the study of time expressions in NLP.  Specifically, the cross-lingual and cross-cultural focus of this paper provides several insights on the challenges of temporal commonsense that can inform research on the topic by highlighting -- often neglected in NLP -- language variability and speakers (time) experiences. This, in particular, emerges in sections 2.3, 5.2, 5.3 but also in 7.   Besides being reported as a quite informative process (section 2), the creation and consequent release of temporal gold standard annotations for 4 different languages can be a useful resource for the community.  The paper is reasonably well-written and pleasant to read. ",
    "weaknesses": "(1) It is claimed that this paper “propose a task”, “reframe a research question”. It thus seems to suggest that this work addresses temporal grounding as a *new* task. However, information about its utility and scenarios of applicability is not really elaborated (just a generic sentence at l.60) and are rather left to the reader to imagine. Also, the related work is presented as more of a description of previous studies rather than a critical “mapping”. As a consequence, it is hard to situate the proposed methods and insights and how they differ from/ and contribute to the topic. I would suggest being more specific and explicit about its contributions and how it relates to previous work.  (2) I see some issues with the proposed methods and evaluation: 2a) Figure 2 shows how different annotators (for the same language) referred to different time ranges for the same part of the day. In fact, Hindi annotations suggest that night can span till 9 am, thus overlapping with the time range for the morning, too. Then, at lines 195-99, the extractive approach is defined as to infer *non-overlapping* time ranges. Finally, in Figure 3, the gold standard annotations are represented as non-overlapping time spans among parts of the day. It is however unmentioned how a clear-cut distinction across parts of the day with definite time spans was defined to create such a final benchmark.  2b) Section 3.1: the extractive corpus-based approach relies on *English* Wikipedia data. No information about the number of time expressions needed is however provided. Also, I wonder whether by relying on English time expressions -- which are then automatically translated into other languages -- a strong western bias is induced as well as translation errors: was there someone with the needed language competence to verify the soundness of such translations? This part should be better documented, for instance in the supplementary material. \n  2c) The translation error issue presents itself also in section 3.2. Footnote number 5 mentions that BERT queries are based on the template “The <morning> starts at <9.00>\", and that such sentences are automatically translated into other languages. In a language with grammatical gender such as Italian, however, the translation of “the” would vary depending on the mentioned part of the day (e.g. the afternoon: IL pomeriggio; the morning: LA mattina). Is this something that has been adapted? If not could it have skewed BERT predictions?\n2d) In section 4.2. the proposed approaches are compared against a baseline based on the “greeting method” by Vilares and Gόmez-Rόdriguez (2018). Their work however does not really seem to serve well as a baseline since it does not entail a *method*. Rather, they created a corpus to conduct an analysis on the semantics of greetings. Thus their goal is different from the one pursued in this paper, and their corpus here is simply employed to test the extractive method (3.1) on a different source of data.  (3) Although the paper is reasonably well written and pleasant to read, some turns are taken for granted and not really justified. For instance, the analysis in section 5 seems to concern the 24 unlabeled languages, this is however left unstated. Also, for instance, in 5.1 the analysis is carried out for Italian only, but the choice for such a decision is not given. ",
    "comments": "As a general comment, I find that this paper seems to be a bit scattered, or better, it alternatively shifts from a culturally-situated focus to the strive for “language-agnostic” approaches. Besides the fact that I am having some doubt as to whether such approaches grant the definition of language-independent method (it does not seem to be very effective on all languages, it largely relies on *English* data and concepts, e.g. noon), I think that such shifts bring the paper out of focus at times and may affect its narrative. Note that this is more  more of an opinionated point of view (which could be discarded and I am thus not putting in the weaknesses section), but I think the paper should enhance the former, linguistically and culturally grounded perspective, which in my opinion is also the main strength of this work.  Few minor suggestions: - footnote1. move it at line 58 - footnote2: specify HIT acronym - the related work would be maybe put to better use after the introduction Finally, as per https://2021.aclweb.org/ethics/Ethics-review-questions/, information about the compensation of annotators via Amazon Mechanical Turk has to be provided. ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "1 = Not my area, or paper is very hard to understand. My evaluation is just an educated guess."
  }
]