[
  {
    "review_id": "b9180336235e3222",
    "paper_id": "ARR_2022_27",
    "reviewer": "Zirui Wang",
    "paper_summary": "This paper studies the problem of lifelong learning in the context of language model pretraining. The goal is to continuously learn new pretraining data domains for a language model such that we do not need to retrain a new one from scratch. They propose a method called ELLE, which aims to expand the current model's width and depth upon a new data source is available. A few related techniques are also applied to further boost performance, e.g. function recovering finetuning, domain specific tokens. Overall, the method is valid with plenty of experimental results, yet its practicality remains unclear. ",
    "strengths": "1. This paper studies lifelong learning for model pretraining. This setup is less studied in lifelong learning literature. \n2. The proposed method works well on all experiments considered, with an astonishing amount of analysis (in the appendix). \n3. The paper is easy to follow and well written. ",
    "weaknesses": "A critical limitation is how practical the method is given the nature of model expansion. This method is studied under a still relatively synthetic setup. There are a lot of problems that I can imagine for real-world large scale models such as GPT3. To mention a few: (1) How should we decide when to expand the model? In reality, these models are trained on O(100B) data, covering a significant portion of the whole internet. So when do we know a new data source emerges? How to detect this? ( 2) Large scale models are trained using sharding systems of thousands of accelerators, it is a challenging technical question to expand them in a way described in this paper. ( 3) Recent works have shown it is possible to continue training language models for either language understanding [1] or additional applications such as code synthesis [2]. Therefore, perhaps these simple approaches are sufficient enough for good generalization.\n[1] Finetuned Language Models Are Zero-Shot Learners. Wei et al., 2021. \n[2] Program Synthesis with Large Language Models. Austin et al., 2021. ",
    "comments": "How is the prompt token computed at inference time? Is it included using nearest neighbor search or not included at all? ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]