[
  {
    "review_id": "e4ac3556d3516a52",
    "paper_id": "ARR_2022_131",
    "reviewer": null,
    "paper_summary": "The paper proposed a method for referring image segmentation. The basic architecture is based on the idea of cross-modal transformer. It processed linguistic feature and multi-layers of visual embeddings through the cross-modal transformer to obtain the multi-layer visual-linguistic embeddding. The multi-layer visual-linguistic embedding is further aggregated through the proposed hierarchical cross-modal aggregation. The proposed model achieves better performance than previous baselines. ",
    "strengths": "The task of referring image segmentation is very interesting. I still wonder whether it is necessary to conduct visual grounding on pixel level. Even though, the task is very challenging and interesting. \nThe motivation example in Fig. 1 is pretty interesting. It shows the advantage of the proposed approach. ",
    "weaknesses": "The proposed architecture seems like a cross-modal transformer (3.2 synchronous multi-modal fusion) and a multi-layer feature aggregation (3.3 hierarchical cross-modal aggregation). \nWith this standard cross-modal architecture, it is unclear to me why the proposed approach could resolve the example in Fig. 1, while the other approaches failed to achieve.\nSect. 3.3 puzzled me the most. It is unclear to me why the affinity weights should be defined as Eq.2? Why is the Convolution necessary? What is the motivation of choosing the specific form of hierarchical cross-modal exchange?  I feel the major issue of this paper is the motivation example is not closely connected to the proposed approach. Therefore, it is not clear to me why the proposed approach could solve the motivation example. ",
    "comments": "None ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]