[
  {
    "review_id": "a4d284a7d3c4ce82",
    "paper_id": "ARR_2022_46",
    "reviewer": "Rahmad Mahendra",
    "paper_summary": "This paper advocates the importance of cultural awareness when designing an NLP solution. The authors of this paper identify four dimensions of culture associated with the NLP systems, i.e., linguistic form, common ground, aboutness, and values. Then, the authors propose the strategies to work on cross-cultural NLP, which cover three areas, namely data collection, model training, and translation. ",
    "strengths": "Several reasons to accept this paper in ACL special theme track: + Understanding the challenges of cross-cultural and multicultural NLP can improve the NLP systems to serve the users in a more inclusive world. This paper raises the issues, surveys existing strategies, and highlights directions for the future development of cross-cultural NLP. \n+ When discussing the four cultural factors, the authors cite the various examples from different culture around the world (not Western centric only). For example: Latin America, Middle East (section 2); India (section 4); and Africa (section 6).    + Most recommendations, regarding data curation, annotation, translation, and model bulding, are sensible and formulated in systematic way. ",
    "weaknesses": "- The author describes that the four components of culture are represented orthogonally (Figure 1). In fact, most of these components depend on each other. ",
    "comments": "Line 338, \"..towards shifting the current culture into a hopefully more equitable one\". What is meant by \"current culture\"?\nLine 642, \"..more diverse cross-cultural representation\". What is the concrete implementation of this idea when building an NLP model?\nIn which NLP tasks is cultural bias a prominent issue and needs to be prioritized to address? ",
    "overall_score": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  },
  {
    "review_id": "3d9bd4f696a0ffd9",
    "paper_id": "ARR_2022_46",
    "reviewer": null,
    "paper_summary": "The paper proposes to trace an agenda for cross-cultural NLP, first by identifying four axes of variation for cultures (linguistic form and style, common ground, aboutness, objectives and values) and describing the challenges related to them; then by highlighting possible strategies for mitigating cultural biases in modern NLP in the areas of data collection, model training and translation.\nI am not an expert on the issues under discussion in this paper, so it is not easy for me to provide a balanced evaluation. I enjoyed reading it, especially for the attempt of brining awareness on cultural issues, which are often neglected in current NLP practices. I think the authors did a very extensive and comprehensive work on the bibliography, which could be useful for correcting biases.\nOn the other hand, I feel that is often difficult to disentangle between linguistic and cultural dimension, and in many cases  the problems/solutions are overlapping with the typical low-resource language scenarios (e.g. where a particular language/dialect/sociolect can be associated with a specific cultural group), and in such cases the general heuristic could be described as \"the more cultural-specific data we can acquire, the better\"; while in other cases it is difficult to propose any conclusive solution (e.g. see the case for model training in Section 6.2, where methods balancing for bias would require access to demographic attributes, but the problem would persist because one cannot really be sure that such attributes adequately reflect culture).  I guess this is a general problematic when one has to deal with something like culture, which is notoriously difficult to define. \nAt the end of my reading, I still feel that I did not get what are, specifically, the directions indicated by the authors (this might well be a limitation of mine) ... ",
    "strengths": "The topic is highly relevant for the special theme of this year, and the issue of cross-cultural NLP is a new and interesting perspective. \nThe survey takes into account a wide body of references that might be useful for NLP researchers. ",
    "weaknesses": "The difficulty in defining culture and in disentangling between linguistic and cultural dimension make it also difficult, in many of the cases exemplified by the authors, to trace a clear roadmap for a cross-cultural NLP. ",
    "comments": "l. 141 varies --> vary l. 466 datasts --> datasets ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "1 = Not my area, or paper is very hard to understand. My evaluation is just an educated guess."
  }
]