[
  {
    "review_id": "e2d151b750ec5e24",
    "paper_id": "ARR_2022_101",
    "reviewer": null,
    "paper_summary": "This paper borrows a idea from the optimal transport problem to propose a framework for evaluating and interpreting semantic textual similarity (STS). The authors use token-wise similarity from pre-trained language models, which differs their method from the previous sentence-wise comparisons between representations, like SimCSE. The method is simple but performs well as it defeats SimCSE on most STS and all iSTS datasets. The authors then analyze their method is both efficient and interpretable for STS. ",
    "strengths": "1. The method used in this paper is simple and interesting and it’s natural to utilize word-level similarity to textual similarity.  2. The main results and analyses verify the efficiency, interpretability, and strong performance of the method.  3. The paper has been structured well to answer my questions during the reading. The explanation for the main method has been well organized to help readers understand the algorithm with ease.\n4. There is a wide range of analyses that support the claims of the authors, making this work fairly solid. ",
    "weaknesses": "1. The method in this paper is quite similar to BERTScore, but the authors have not cited that paper.\n2. Figure 2 does not show the time complexity of SimCSE_{CLS} method.\n3. I am confused about the definition of \"\\vec \\mathbf{1}\" in Equation(1). ",
    "comments": "Missing citation: BERTScore: Evaluating Text Generation with BERT (Zhang et al. 2020) For other suggestions, please refer to the weakness section. ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]