[
  {
    "review_id": "840a52764399d19c",
    "paper_id": "ARR_2022_109",
    "reviewer": "Bowei Zou",
    "paper_summary": "This paper presents a new point of view that the success of neural text matching models lies in learning the length divergence bias on datasets. To this end, the paper constructs adversarial test sets to verify this conclusion. The results show that the performance of TM models on such test sets is worse. To address it, the paper conducts the same method to construct adversarial training sets and retrain TM models on them. ",
    "strengths": "Verify that adding adversarial data can improve the robustness of the text matching models. ",
    "weaknesses": "1. This paper seems to reduce the impact of semantic noise on text matching to \"length divergence bias\". From the first example in Table 1, it can be seen that what affects the model's prediction should be that T2 contains more other semantics (noise) such as \"Canadian\", \"University of Waterloo grads Kaheer Suleman and Sam Pasupalak\", which may lead to semantic representation drifting and then affects the TM models. In my opinion, the \"length divergence bias\" should only have a discrepancy in the length of the textual expressions rather than introducing additional semantics. \n2. Lack of details and intuitive examples of the constructed adversarial datasets. ",
    "comments": "- Line 136-138: \"... we down-sample each category to align with the average PosRatio of the whole test set\". Could the authors provide more details about the adversarial data construction?\n- Could the authors use some specific examples to analyze why the constructed adversarial training sets can improve the robustness of the TM models? ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  },
  {
    "review_id": "d420c861389d357c",
    "paper_id": "ARR_2022_109",
    "reviewer": "Steffen Eger",
    "paper_summary": "The paper discusses length bias for textual matching models, shows that models are prone to this bias, gives an explanation why, and proposes a solution to correct it. ",
    "strengths": "- Identification of a new bias - Solution (adversarial training) to address it - Investigation of IR and \"NLP\" model settings ",
    "weaknesses": "- This is the (n+1)st paper on discussing biases in models and datasets and it's not clear to me whether this specific bias hasn't been discovered before - not a single 2021 paper cited - models investigated (ESIM, etc.) are a bit old, no novel model is included - the explanation via probing is a bit trivial (this probing has been criticized btw., as unreliable [1]); it's also not clear to me why BERT performs best in the probing, but is least prone to the length diversion bias, questioning the apparent explanation - in l.237, authors write \"except for one combination\", but there are quite a few negative signs in Table 3, indicating that adversarial training is less often helpful - the losses from length bias are often small, e.g., 1 percentage point for BERT [1] https://aclanthology.org/2020.conll-1.8.pdf ",
    "comments": "- Textual matching is also relevant for evaluation metrics [2], where similar biases (e.g., lexical overlap) are discovered. It would be interesting to extend this analysis and also consider models from such communities [2] https://aclanthology.org/2021.emnlp-main.701/ ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]