[
  {
    "review_id": "bbc7d50e7c4592ae",
    "paper_id": "ARR_2022_194",
    "reviewer": null,
    "paper_summary": "This paper proposes NoisyTune, which is a method to add noise using the standard deviation of matrix-wise parameters during fine-tuning pretrained language models. The main motivation of using NoisyTune is in line with other work (e.g., by Chen et al. 2020 and Lee et al. 2020) on avoiding large deviation of parameters from the pretrained model to avoid overfitting during finetuning. Experimental results on XTREME and GLEU benchmark datasets suggest that NoisyTune gives small improvement consistently on various settings. ",
    "strengths": "- Simplicity of the method: A matrix-wise standard deviation of parameters is only necessary to use this method - Comparison with a simple baseline of adding a global noise - Parameter matrix-wise distribution is useful for adding noise - Experimental results with four different pretrained language models ",
    "weaknesses": "- The performance gain by using NoisyTune on XTREME and GLEU is very small (less than 1 point in accuracy or F1 score).  - No standard deviation scores are reported, and the comparison of the performance gain vs. standard deviation is not reported.\n- The methods compared in the experiments are only with using global noise. ",
    "comments": "### Comments - I suggest further experimenting with various hyperparameters and would the addition of NoisyTune be complimentary to hyperparameter tuning.\n- Since the motivation of this paper is avoiding overfitting during fine-tuning, I would be very curious to see NoisyTune in few-shot settings, where overfitting is more of an issue.\n- [Minor] For Figure 4, preferable to have legends outside the plot.\n### Questions to the Authors - Are different hyperparameters (e.g., drop out rate) explored? Would it be possible that tuning one of the hyperparameters leads to larger gains than using NoisyTune?\n- What is the standard deviation across multiple runs for e.g., Table 1 and Figure 2? ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  },
  {
    "review_id": "0f6a2b765962004b",
    "paper_id": "ARR_2022_194",
    "reviewer": "Jiali Zeng",
    "paper_summary": "This paper proposes NoisyTune, which is a matrix-wise perturbing method by adding different uniform noises according to the standard deviations of different parameter matrices. ",
    "strengths": "A simple method ",
    "weaknesses": "There are some questions: Q1. Even simple, I doubt its effectiveness. The experimental results of both GLUE and XTREAMRE show that the improvements are range from 0.2 to 0.8 (Avg score), which seems not significant. \nBesides, please report the standar­­d deviations of 5 times runs in Table 1 and Table 2.\nQ2. The over-fitting problem is more serious in large models, so the experiment of applying NoisyTune on larger PLMs will be more convincing.\nQ3.  The right Fig of Fig3 makes me confusing, which is not consistent with the claim “the relative change of L1-norms becomes smaller when NoisyTune is applied”.\nQ4. Missing the most relevant work, ­­­raise a child in Large Language Model: Towards Effective and Generalizable Fine-tuning. Xu et al., EMNLP 2021. It masks out the gradients of the parameters during the backward process. The difference between NoisyTune and above-mentioned paper is using masking or noisy to perturb parameters. Thus I am very interested to see which method (masking or noisy) will have better benefits. ",
    "comments": "See above ",
    "overall_score": "1.5 ",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]