[
  {
    "review_id": "8ef3fa547505100a",
    "paper_id": "ARR_2022_66",
    "reviewer": null,
    "paper_summary": "This review is for a resubmission that I reviewed earlier. Hence, I will be focusing more on the changes from the last submitted version.\nFirst of all, I would like to thank the reviewers for their detailed responses to my, and other reviewers', concerns.\nFor the previous version of this submission, I had two major concerns. First, one of the datasets used by the authors is not public. The authors have committed to releasing the dataset, pending approvals from the concerned organizations. I really appreciate the authors' willingness to do so and look forward to the valuable resource being available for the research community.\nMy other concern was that the job representations learned by the proposed approach were not used in downstream tasks that could illustrate the utility of the representations and how the representations fare with respect to other off-the-shelf representations (say using BERT). The authors have presented results on the next-job prediction task. ",
    "strengths": "- Well-written paper, tackles an interesting application - The authors will be making a new dataset public which would be a useful resource for the community ",
    "weaknesses": "I thank the authors for conducting additional experiments on testing the utility of learned job title representations for the next job prediction task. However, the results reported in the updated draft have reinforced my concerns regarding the effectiveness of the learned job title representations. As Table 3 shows, BERT-based representations outperform on the task when compared with representations learned by the proposed solution under various settings. Even on the classification task, the performance of BERT and Word2Vec methods is reasonably well. Thus, it is not clear what, if any, are the advantages of using the proposed solution for learning job title representations. Some gains in performance, in some settings, could certainly be achieved but at the cost of significantly more computationally expensive solution compared to using off-the-shelf BERT or W2V representations. ",
    "comments": "In sum, I would keep my earlier scores unchanged. While I appreciate the efforts undertaken by the authors to test on a new task, the results, unfortunately, are not infavor of the proposed solution. ",
    "overall_score": "3 = Good: This paper makes a reasonable contribution, and might be of interest for some (broad or narrow) sub-communities, possibly with minor revisions.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]