[
  {
    "review_id": "8b6c32570a76bc3f",
    "paper_id": "ARR_2022_170",
    "reviewer": "Yixin Nie",
    "paper_summary": "This paper introduced LimitedInk, a self-explaining model that outperforms the existing baseline on both end-task predictions and human-annotated rationale agreement. More importantly, the paper shows that unlike the finding from the previous studies, the shortest rationales can not present the best explanation for human understanding which call for more careful design on evaluating human rationales. ",
    "strengths": "The paper conducts a human study on rationales. The finding contradicts the typical intuition about rationales that the shortest rationales are the best to explain human understanding. This would encourage a fundamental rethinking and revolution of rationale research. ",
    "weaknesses": "I guess that is due to content limited. It would be better to see some qualitative analysis on why 10-30% rationales can already give decent performance whereas human needs at least 40% rationales. It seems to indicates that the downstream model is making predictions in a way that is very different from how human make predictions. ",
    "comments": "I would suggest adding some qualitative analysis to explain the title of the paper in later version. ",
    "overall_score": "4.5 ",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  },
  {
    "review_id": "2b254596d32b539c",
    "paper_id": "ARR_2022_170",
    "reviewer": null,
    "paper_summary": "Existing self-explaining models mostly generate the short rationales with the assumption that short rationales are more intuitive to humans, while this work discusses the question that whether the shortest rationale is the most understandable for humans. In this work, the authors design a self-explaining model, LIMITEDINK, that can take controls on rationale length by incorporating contextual information and supporting flexibly extracting rationales at any target length. By generating rationales at different length levels, the authors study how much rationale would be sufficient for humans to confidently make predictions. Experiments on various tasks demonstrate that the proposed method outperforms most prior works, and meanwhile show that the shortest rationales are not the best for human understanding. ",
    "strengths": "1. The method proposed in this work is effective and can outperform several strong baselines on the performance of both label predictions and rationale predictions.\n2. The problem, the effect of the rationales at different length levels, discussed in this work is meaningful and the conclusions may serve as good guidance for further research in this field. ",
    "weaknesses": "1. Although this work points out that shortest rationales are largely not the best for human understanding, the appropriate lengths are still subject to the datasets or even the instances. The length of meaningful rationales may largely depend on the density of the information related to the task. As pointed in Section 5, a more rigorous evaluation is needed to better understand what is a good rationale explanation.\n2. This work does not report how \"short\" the rationales generated by prior works are. As shown in Section 1, recent works agree that good rationales should be \"shortest yet sufficient\", while this work seems to simply focus more on \"shortest\". This brings out the concern that whether the main question discussed in this work can really stand for the trend of current works on this task. \n         (a). I think one potential solution to handle this concern is that - by extending or shortening the golden rationales and see whether such perturbations outperform or underperform the original one. ",
    "comments": "1. I would like to see some examples of the generated rationales at different length levels from the proposed methods, as well as the rationales generated by the baselines. Such examples can help the readers to better understand the influence of rationale lengths. ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]