[
  {
    "review_id": "0864d17ce562e160",
    "paper_id": "ARR_2022_358",
    "reviewer": "Marco Antonio Sobrevilla Cabezudo",
    "paper_summary": "The authors propose a framework for taxonomy expansion (TE). Particularly, they explore the training of two common operations in TE (attach and merge) together. Experiments are performed on three WordNet taxonomies and the results show improvements for attaching and competitive results for merging. ",
    "strengths": "- The task is quite interesting and it is important for updating resources in different languages.\n- Unlike previous approaches, the proposed model is able to give answers to two operations. In addition, the performance in both tasks are improved or got encouraging results.\n- Diverse experiments conducted along the work. ",
    "weaknesses": "- Some definitions and statements are not clear or well justified.\n- Lack of clarity in the definition of the input/outputs for each subtask ",
    "comments": "063-065 Though most of the existing studies consider the expansion a regression problem ... -> Missing a reference to support this statement 081-082 TEAM that performs both the Attach and Merge operations together -> Performs attach and merge together or is trained together?\n092 Missing reference for wordnet definition 112-114 \"The taxonomy T is arranged in a hierarchical manner directed edges in E as shown in Figure 1.\" - > It doesn't seem clear.\n115 query concept q: Is this a concept or a candidate word? Your initial examples (Page 1) mention \"mango\" and \"nutrient\" and do not seem to be concepts according to your definition.\n188 the query synset sq -> Is this a query synset or a word that belongs to the synset (concept) X. I am not sure if I understand correctly but in the case of attach, the query concept is a (d, ss): definition, synonymns included in the synset. However, it is not clear to me if it is the same for merge as it seems like the query concept is (d, ss) but ss is just the word that you are removing.\n214 and the synset is represented by the pre-trained embedding of the synonym word itself. - > It applies for merge in most cases but it is not case for attach, right? Because attach considers candidate concept (that can be composed by a synonym set) 224 comprising of the node -> that comprises the node ... 245 The GAT is trained with the whole model?\nNeeds to be reviewed by a English native speaker and some sentences need to be rewriting for improving the clarity. ",
    "overall_score": "3.5 ",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  }
]