[
  {
    "review_id": "dffe09af858bbf08",
    "paper_id": "ARR_2022_255",
    "reviewer": "Rishabh K Iyer",
    "paper_summary": "The paper evaluates the effectiveness of GROUP robust algorithms in the multi-label classification scenario under temporal concept drift. Empirical analysis of the paper highlights how some group robust approaches like Spectral Decoupling, IRM are more suitable for tackling temporal concept drift and label imbalance in the multi-classification setting. ",
    "strengths": "1. It is one of the initial works that analyzed the group robust algorithms' performance in the context of multi-label classification.\n2. The authors provided detailed remarks on why some group robust algorithms are more suitable for tackling the temporal drift in the context of multi-label classification. Furthermore, they pointed out some critical drawbacks of recent approaches like GROUP-DRO when applied naively.\n3. The work shows that some GROUP robust approaches like IRM can efficiently tackle the problem of temporal concept drift as well as the more computationally expensive label-attention-based approaches(WLAN). ",
    "weaknesses": "1. Being an empirical evaluation paper, I am not sure whether the numbers reported are after a single run or multiple runs. If only a single run is considered, it is highly advised for the authors to report numbers along with standard deviations after multiple runs.\n2. Similarly, it is also unclear whether the hyperparameters for each GROUP-Robust algorithm are adequately tuned.\n3. The authors highlighted the problems of existing approaches like GROUP-DRO when naively applied to the multi-label classification scenario. However, It is not very helpful to compare with such naive adaptions, in my opinion. For example, one can intelligently adapt the GROUP-DRO algorithm to multi-label classification by considering multiple weights(one for each label) for each group instead of a single weight and adapting the weights based on the corresponding label binary cross-entropy loss. By assigning multiple weights, we can still assign higher weightage to minority classes rather than considering the average losses in the group.\n4. It would be valuable to the paper if authors discuss possible intelligent adaptations of existing group-robust algorithms to multi-label classification scenarios rather than just stating the problems of naive adaptations. ",
    "comments": "See above ",
    "overall_score": "2 = Borderline: This paper has some merit, but also significant flaws. It does not warrant publication at top-tier venues, but might still be a good pick for workshops.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]