[
  {
    "review_id": "7ac917aef92a6a0b",
    "paper_id": "ARR_2022_42",
    "reviewer": null,
    "paper_summary": "This paper developed a new dataset, GlobalWOZ, a multilingual extension of the English MultiWOZ to about 20 languages through machine translation (to save cost) and replacing entities occurring in the English dataset with local entities that are most likely to be used in a foreign language (in the country where the language is spoken). They considered the following 3 use cases: (1) a foreign language speaker uses ToD in the foreign-language country (F&F), or (2) an English country (F&E), (3) an English speaker uses ToD in a foreign-language country (E&F), which are different from the traditional E&E use case where an English speaker uses ToD in an English-speaking country.  To ensure that the dataset captures more local entities in the foreign countries of interest, first, English-specific entities are replaced with a set of general-purpose placeholders, followed by the translation of the sentences (without entities), and lastly, ontologies containing definitions of dialogue acts, local entities and their attributes in the target language countries are used for placeholder replacement. The dataset created consists of high-quality test sets in 3 languages (Chinese, Spanish, and Indonesia) that have been post-edited by professional translators after machine translation. The test sets of the remaining 17 languages are machine translated.  For the experiments, they compare the performance of their approach to zero-shot evaluation when transferring from English and using translated english dataset for training. ",
    "strengths": "- They introduced a very important dataset over 30 languages, they also compare the quality of the dataset that has been machine-translated with the one machine translated and post-edited by professional translators on 3 languages (Chinese, Spanish, and Indonesia).  - The paper is well-written and the experiments are quite interesting. ",
    "weaknesses": "- The translation quality for low-resource languages should be discussed. For example, some low-resource languages like Swahili may give poor performance if they have not been trained on dialogue texts. ",
    "comments": "NA ",
    "overall_score": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  },
  {
    "review_id": "ae976a7ae222dcfb",
    "paper_id": "ARR_2022_42",
    "reviewer": "Samuel Cahyawijaya",
    "paper_summary": "The paper introduces GlobalWoZ, a  mutllingual task-oriented dataset built from translating MultiWoZ dataset to 20 other languages. The paper first provides deep analysis on 3 use cases for ToD (E&F, F&E, F&F) aside of English-speaker in English-speaking country. The dataset is built by generating template, translating the dialogue, and template filling with local entities based on a crawled ontology.\nThe paper shows and extensive experiments on utilizing the datasets by only including single use-case (SUC), Bi-lingual Bi-use-case (BBUC), Multilingual Bi-use-case (MBUC),Multilingual multi-use-cases (MMUC). The experiment shows the effectiveness of using the translated data on all 3 use-cases in both zero-shot and few-shot settings by applying SUC, BBUC, MBUC, and further show generalization on all use-cases using a single MMUC model.  The paper shows the importance of code-switching use-cases (i.e., E&F and F&E) and further provides interesting discussion on overestimation of translate-train baseline which is commonly used in building a practical setting of a multilingual ToD system especially on local entities. Additional experiment on the impact of training on data is also analyzed in the paper. Lastly, the paper shows that machine translated data can be a good proxy for a machine translated data with an additional human curation step, and further provide translated MultiWoZ dataset for 17 other languages. ",
    "strengths": "• The paper introduces GlobalWoZ, a translated multilingual ToD dataset covering 20 languages with 3 practical use-cases of a multilingual ToD system • The paper shows extensive analysis on all 3 use-cases which provides an empirical proof on the effectiveness of the GlobalWoZ dataset and performing joint training on all the use-cases to achieve better generalization for a multilingual ToD system.\n• The paper shows a performance gap in the translate-train model (a common baseline in multilingual ToD) when the data contains local context.\n• The paper shows that a machine translated data can be a proxy for a human curated data ",
    "weaknesses": "• The paper doesn’t show the quantitative differences between MT and MTPE datasets are not presented on the paper • The paper shows that machine translated data can be used as a proxy for human translated data, but only compare with post-editing approach which provides bias for the human editor. ",
    "comments": "• The paper doesn’t show the quantitative differences between MT and MTPE datasets are not presented on the paper • The paper shows that machine translated data can be used as a proxy for human translated data, but only compare with post-editing approach which provides bias for the human editor.\n• Line 131 “another” -> “other” ",
    "overall_score": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  },
  {
    "review_id": "0dc642dca260bbad",
    "paper_id": "ARR_2022_42",
    "reviewer": null,
    "paper_summary": "The paper explores three unexplored usecases on multilingual task-oriented dialogue (ToD) systems where the speaker where a foreign language speaker uses ToD in the foreign-language country (F&F) or an English country (F&E), and an English speaker uses ToD in a foreign-language country (E&F). They introduced a curation method by creating a template, create the ontology, translate using machine translation, and then ask annotators to edit the translations. This method is claimed to be cost-effective. ",
    "strengths": "- A new multilingual use case for ToD that can be useful for investigate the behavior of speakers living in different locations.  - The curation method is cost-effective. It requires a limited amount of post-editing efforts for a test set.\n- Extensive experiments on different scenarios. ",
    "weaknesses": "- It is unclear how the human annotations process is done (for example: how many annotators per sample and the acceptance criteria).\n- The motivation of the three experimental settings is relatively weak. It can be better explained in the introduction. The settings are interesting if they are appropriately described and given a more substantial reason why they are important. For now, it looks like the authors are trying to explore new settings without supporting rationale.\n- The authors do not explore the performance drop when using local entities in the experiments. ",
    "comments": "Comments: 1. Please add more descriptions as the authors undergo the human annotation process. \n2. It would be better to add examples for each setting.\nQuestions: 1. What are the criteria for selecting the human annotation results for the post-edit stage? Did you apply additional quality assurance after adding the entities to the samples? And, how much changes after the post-edit stage? \n2. Why did the significant performance drop occur when using local entities in the experiments? \n3. Did you manage to measure the quality of the samples you collected using the proposed method? ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]