[
  {
    "review_id": "e3d637ae00e884f7",
    "paper_id": "ARR_2022_25",
    "reviewer": "Diane Napolitano",
    "paper_summary": "This paper describes the development of a data set that can be used to develop a system that can generate automated feedback to learners' responses to short-answer questions.  The data set includes questions, their answers, and their feedback in the domain of computer networking, mostly in English but with a sizable German subset as well.  The paper describes the construction of the data set, including agreement and encountered challenges, as well as experimental results that can serve as a baseline for future work. ",
    "strengths": "Although the domain is niche, since the authors do an extremely thorough job of thoughtfully constructing their data set with expert annotators and guidance, agreement-measurement, and validity evidence, this paper should serve as a model to the community with respect to how to compile similar data sets.\nWhile the authors mention that the data set is small -- 4,519 response/feedback pairs covering 22 English and 8 German questions -- it's actually quite large for something that is completely human-compiled and human-reviewed.\nThis paper is very clear, easy to follow, and well-organized. ",
    "weaknesses": "Unfortunately, the final data set contains imbalanced classes, something the authors aim to address in future versions of the data set.  I wouldn't use this as a reason to reject this paper, however.\nSome in our community may find this work, and its domain, rather niche; this paper would be a great fit for the BEA workshop. ",
    "comments": "Can the authors mention the dates during which the data was collected?  Since this was such a big manual effort, I wouldn't be surprised if the bulk of the work was done in 2021 on data collected in 2020, for instance. This is also important since the domain is computer networking which changes fairly rapidly.\nOn line 005, insert \"many\" between \"by\" and \"Automatic\".\nOn line 040, change \"interesting\" to \"useful\".\nOn line 054, \"in the last decades\" should read \"over the past decades\".\nOn line 154, \"detrimental for\" should be \"detrimental to\".\nThe last sentence of section 2.2, beginning with \"Lastly, structured collections...\" seems out-of-place here.  Should this be a separate paragraph?  Or can you do more to tie it in with the preceding sentences?\nOn line 395, \"refined for multiple years\" should be \"refined over multiple years\".\nIn this field, it's typical to refer to learners' responses to questions as \"responses\" rather than \"submissions\".  Just a minor thing you may want to consider :) ",
    "overall_score": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.",
    "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work."
  }
]