[
  {
    "review_id": "58449473f83ef41c",
    "paper_id": "ARR_2022_247",
    "reviewer": null,
    "paper_summary": "Motivated by the shortcomings and relative simplicity of existing natural language understanding (NLU) benchmarks for task-oriented dialogue (ToD), the authors propose NLU++, a novel dataset created by NLU experts that provides fine-grained domain ontologies, contains a large amount of multi-intent sentences, differentiates between domain-specific and generic intents and slots, and is tailored to address problems observed in industrial ToD applications. NLU++ is intended to be challenging to state-of-the-art ToD systems and emphasizes sample quality over quantity. It includes two domains (\"Hotel\" and \"Bank\"), with 1k and 2k samples, respectively.\nThe authors perform a series of intent detection (ID) and slot labeling (SL) experiments based on this new resource, with a particular focus on low-resource settings. For intent detection, MLP classifiers are compared with models based on the question answering (QA) paradigm. The presented findings demonstrate that QA models generally outperform MLP models on the ID task, achieving F1 scores of up to 93 points. SL proves to be more challenging, with the evaluated models obtaining F1 scores of up to 72 points. Unsurprisingly, F1 is substantially lower in the low-resource setting for both tasks. The authors also demonstrate that generic intents transfer across domains, with ID models trained on the one of the two domains being able to detect generic intents in the other domain with substantial accuracy. ",
    "strengths": "- NLU++ represents a high-quality, richly annotated TOD resource that captures the requirements of industrial TOD systems and, as such, is likely to facilitate the development of improved dialogue models that are effective in the low-resource setting (assuming the dateset will be publicly available).\n- The experimental section is extensive enough to showcase the properties of NLU++ and illustrates well as to why it may be of interest to subsequent studies.\n- Cross-domain experiments that focus on domain-general intents and slots are interesting and insightful. ",
    "weaknesses": "- The paper would benefit from a more thorough discussion of the data collection / selection process, as well as from an evaluation of the annotation consistency between the four enlisted NLU experts (e.g. how high is the inter-annotator agreement, does having only four annotators introduce unwanted annotation artifacts or biases, were the annotations validated in any way?).\n- Line 296: A detailed explanation of how the new samples were created should be added.\n- Table 4: It is unclear why MultiWoZ was not included in the comparison. ",
    "comments": "None. ",
    "overall_score": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  },
  {
    "review_id": "24c4ce1de0320c57",
    "paper_id": "ARR_2022_247",
    "reviewer": null,
    "paper_summary": "This paper presents NLU++, a new dataset for NLU tasks including intent detection and slot labeling across two domains, banking and hotels. The authors emphasize a focus on multi-intent sentences, a combination of cross-domain and domain-specific intents, and high quality through expert annotation. ",
    "strengths": "- The annotated dataset appears to by high-quality and useful to the research community.\n- The authors do an interesting and extensive evaluation of the dataset for intent detection and slot labeling tasks with different baselines. ",
    "weaknesses": "- The authors should more explicitly discuss other work/data that addresses multi-intent sentences. Footnote 6 discusses work on multi-intent identification on ATIS/MultiWOZ/DSTC4 and synthetically generated multi-intent data (MixATIS and MixSNIPS), but this is not discussed in detail in the main text.  - Additionally, footnotes are used FAR too extensively in this paper -- it's actually very distracting. Much of the content is actually important and should be moved into the main body of the paper! Details around parameter settings etc. can be moved into the appendix to make space (e.g., L468).\n- Some of the intents do not really confirm to standard definitions of an intent, e.g., \"card\" (Fig 1). This does not actually describe the \"intent\" behind the utterance, which might traditionally be something like \"confirm_arrival\". \" Card\" in this case could be considered more like a slot and maintain a similar level of genericness. On the other hand, intents such as \"less_lower_before\" may be overloaded. While it makes sense to try to make slots more generic so they can be reused across new domains, the authors can more explicitly articulate their reasoning behind overloading/over-specifying intents.\n- The ontology definition and annotation scheme itself is glossed over in this paper, although it is a major contribution. The authors should help quantify the effort required and comment on the feasibility of scaling their high-quality annotation to other domains. ",
    "comments": "Comments: - The paper in general is very dense (and thus difficult to get through in parts). The authors frequently include numbered lists in the paragraphs that might be easier to read as actual lists instead of in paragraph form (where appropriate).\n- 163: This statement is unsupported \"First, the models went back to focusing on single-turn utterances, which...\" - Footnote 6: As described in the weaknesses section, the authors should more explicitly describe these works and provide examples of how their work aims to improve on them.\n- 196: Need more description here -- many parts of the proposed NLU++ ontologies are also highly domain specific (e.g., intents like \"spa\" and \"card\").\n- Table 4: Should include other attempts at multi-intent datasets here (DSTC4, MixATIS, etc.).\n- Table 8: Some of the \"description-questions\" shown are ungrammatically, e.g., \"is the intent to ask about some refund?\", or \"is the intent to ask something related to gym?\"\n- Could the annotation scheme be easily scaled up to more domains? How much effort would be involved in ontology definition and annotation?\nTypos: - 166: Space after footnote 5.\n- 340 (and later): \"Data/Domain Setups\" -> \"Setups\" could either be \"Setup\", or \"Settings\"/\"Configurations\"? ",
    "overall_score": "3 = Good: This paper makes a reasonable contribution, and might be of interest for some (broad or narrow) sub-communities, possibly with minor revisions.",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  }
]