[
  {
    "review_id": "f5d14391b40ef9e8",
    "paper_id": "ARR_2022_87",
    "reviewer": null,
    "paper_summary": "This paper proposes a new intermediate task for leveraging tabular data for enhancing the performance of an LM on tasks of unstructured text. The enhanced model shows improvement compared to the original T5 model. ",
    "strengths": "- The paper is overall well-written (though the organization seems confusing, to be detailed in \"Weaknesses\") and the figures are helpful for understanding the paper.\n- The method is intuitive and relatively simple. The semi-structured tabular data are easy to obtain (from Wikipedia or Common Crawls) so the application of this method is promising.\n- The introduced momentum sampling strategy is interesting and can be useful for multi-task training.\n- The improvement on the four datasets are significant. ",
    "weaknesses": "### Original comments - The novelty is limited. This paper mainly uses a template-based generation strategy for EG. Similar techniques have been used in prior works of question generation and semantic parsing.\n- The organization of this paper is confusing. Why there is a \"related work\" subsection in Ln. 323 while there is a whole section of related work (Section 6)? If the authors feel like the related work should be discussed earlier, I suggest moving Section 6 to after the introduction.\n- More baselines should be compared. GenBERT is a very relevant baseline but I think other methods that enhance LM with external knowledge (e.g., KBERT, KnowBERT) should also be compared.\n### After revision The authors reorganize the paper and I have seen improvement in the quality of writing. Also, I've seen the authors have addressed the questions of other reviewers. I thus have updated my recommendation from 3.5 to 4. ",
    "comments": "N/A ",
    "overall_score": "4 = Strong: This paper is of significant interest (for broad or narrow sub-communities), and warrants acceptance in a top-tier *ACL venue if space allows.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]