[
  {
    "review_id": "04e97d4c546e9c4a",
    "paper_id": "ARR_2022_89",
    "reviewer": "Momchil Hardalov",
    "paper_summary": "The paper focuses on the intent understanding of textual TODO notes. The authors propose a weakly supervised approach based on multi-task learning to pre-train better vector representations for the former task. The auxiliary tasks include: (1) autocompletion, MLM objective based on hand-crafted rules, (2) pre-action (what is needed) and goal generation (pseudo intent) and (3) action arguments prediction, using labels from FrameNet. The proposed approach outperforms strong (sentence) embedding baseline models in zero-shot setting. ",
    "strengths": "1. The paper is clearly written and mostly easy to follow, the proposed approach is well motivated. \n2. The task is interesting, especially from a practical point of view. \n3. The presented results are convincing and I think the evaluated baseline models are good enough. One question left unanswered is -- if the selected similarity functions are the best choice for these models, additional ablation is welcome. \n4. Extensive ablation study of the proposed tasks. ",
    "weaknesses": "1. The experiments are held on a private datasets and the exact setup is impossible to reproduce. \n2. A minor point would be that few-shot would be a more realistic setup for that task, as domain-specific TODOs are easy to acquire, however I agree that the current setup is adequate as well. \n3. More error analysis could be useful, especially on the public dataset, as their data could be included without any restrictions, e.g., error types/examples? patterns? Examples when non-contextualized embeddings outperform contextualized ones, or even LITE? ",
    "comments": "I urge the authors to release at least some part of the dataset to the wider public, or under some  end user-agreement.\nComments: 1. I suggest the authors to focus their comparison on word2vec baselines (currently in appendix), instead of Sentence-BERT, as the latter does not show good performance on the short texts. It seems that non-contextualized embeddings are more suitable for the task. \n2. Maybe it makes more sense to try out models pre-trained on conversations, e.g., text from Twitter or natural language conversations. ",
    "overall_score": "3.5 ",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]