[
  {
    "review_id": "a7b2e5cce4c1e1a8",
    "paper_id": "ARR_2022_155",
    "reviewer": null,
    "paper_summary": "This paper analyzes roles of image and text in the problem of claim detection, which is often the first stage of fake news detection. It introduces a novel dataset MM-Claims, which consists of tweets and corresponding images over three topics: COVID-19, Climate Change and broadly Technology. The dataset contains roughly 86 000 tweets, out of which 3400 are labeled manually by multiple annotators for the training and evaluation of multimodal models. It also evaluates strong unimodal and multimodal baselines, and analyzes the potential and drawbacks of current models. ",
    "strengths": "It introduces more fine-grained labels, the tertiary claim classes and visual claim classes, in multimodal claim detection, which is the first step of fake news detection.  Also, they add 2 more topics compared to previous work. ",
    "weaknesses": "1. The paper doesn't show how tertiary claim classes and visual claim classes can help in fake news detection.  So it leads to the question, why do we care the proposed label classes in claim detection? \n2. The annotated dataset size is limited for the use of largely used heavy multi-modal models. And while claims are related to 3 topics, they are still limited. \n3. Experiments include fine-tuning on ALBEF but not fine-tuning on CLIP. \n4. The dataset has conflicts in annotated data. Why not adding more annotators? ",
    "comments": "1. Try to show the value of the dataset -- to show the use of tertiary claim classes and visual claim classes can actually help in fake news detection performance. Also, it will be interesting to see whether using the classification results on visual claim classes can help the classification performance on tertiary claim classes. \n2. Increase the number of annotators each data to avoid conflicts. If possible, annotate more data. \n3. In experiment, it can also do fine-tuning on CLIP. ",
    "overall_score": "2.5 ",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  },
  {
    "review_id": "5c77cd0762b01100",
    "paper_id": "ARR_2022_155",
    "reviewer": "Monjoy Saha",
    "paper_summary": "The authors investigated the roles of image and text at the first stage of the fake news detection pipeline. ",
    "strengths": "objective and Data analysis parts are stronger. ",
    "weaknesses": "From the title of this manuscript, it seems that the authors mainly contributed to the dataset.  The authors mostly applied conventional approaches like SVM. ",
    "comments": "I think it will be better if the authors highlight their methodology as well. It will be better if the authors work on advanced AI algorithms such as deep learning. ",
    "overall_score": "3 = Good: This paper makes a reasonable contribution, and might be of interest for some (broad or narrow) sub-communities, possibly with minor revisions.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]