[
  {
    "review_id": "c013853901da324e",
    "paper_id": "ARR_2022_323",
    "reviewer": "Wei Wei",
    "paper_summary": "This paper focuses on the problem of fine-gained sentiment analysis, i.e., aspect sentiment triplet extraction (ASTE), and propose an Enhanced Multi-Channel Graph Convolutional Network model (EMC-GCN) to fully exploit task-dependent relations and the linguistic features of word-pairs for enhancing the performance of the triplet extraction in ASTE. Specifically, a biaffine function with constraints is used to embed different relations of word pairs for multi-channel graph construction and then aggregate information over such graph, meanwhile a refined strategy is proposed for measuring the match degree of word pairs. The experimental results on the benchmark datasets demonstrate the effectiveness of the proposed model. ",
    "strengths": "1. The usage of rich relations and linguistic features and the construction of multi-channel graph for aspect sentiment extraction problem are novel, which is useful for task-dependent word representation learning and may be benefit for the researchers who encounter similar problems. \n2. The experiments presented in the paper are extensively evaluated. ",
    "weaknesses": "1. The proposed model seems to be similar to the multi-relational GCN model in (“Modeling relational data with graph convolutional networks”, 2018), please give the more discussion about the difference of such two works; 2. For Eq. (6), the learning of each channel of each element in adjacency matrix A via the biaffine attention module is unclear, especially for non-numeric linguistic features like POS combination or syntactic dependency types. \n3. The proposed end-to-end framework seems to be a little ad-hoc, such as the motivation of the selection of four types of linguistic features is obscure, meanwhile the linguistic features are extracted by external toolkits, and thus I wonder the influence of toolkit errors on the performance of proposed model. Furthermore, different linguistic features with constraints (R^{pos}, R^{dep}, R^{tbd}, R^{rpd}) may have different influences on the performance of the proposed model, an ablation study is needed for analysis, such as the independent influence of different linguistic features, and the cross-influences of different linguistic features like feature pair (POS, tree-based) or other combinations. In addition, the proposed model need to aggregate the information from different channel, and thus I wonder how it handle the situation if the values of different linguistic features are not in a same scale? \n4. The refined strategy seems to be a coarse strategy, which is only useful for the relations like “A”, actually I wonder the analysis of the refined strategy on different types of relations of word-pairs, which is benefit for better understanding the influence of refined strategy; ",
    "comments": "Minor errors: the definition of POS has different meanings, e.g., Part-of-Speech for linguistic features, and a type of 10 self-defined relations of word-pairs, suggest to distinguish such two definitions with different symbols. ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  }
]