[
  {
    "review_id": "1ef6ccfd9e3537ad",
    "paper_id": "ARR_2022_345",
    "reviewer": null,
    "paper_summary": "This paper proposes a novel unsupervised sentence embedding framework named DiffCSE. DiffCSE learns sentence embeddings that are aware of, but not necessarily invariant to, MLM-based word replacement. Technically, DiffCSE combines the standard contrastive objective from SimCSE with a difference-prediction objective conditioned on the sentence embedding. Experiments on STS datasets and transfer tasks show the effectiveness of DiffCSE. ",
    "strengths": "This paper is excellent in terms of both writing and technical novelty.\n- Writing: This paper provides sufficient background and includes a comprehensive survey of existing contrastive learning-based sentence embedding frameworks. I was able to read this paper very smoothly.\n- Novelty: The proposed framework is very simple but not naive. It is based on the idea of equivariant contrastive learning, which is first brought to NLP by the authors in the present paper, to my knowledge. The simple yet effective framework should inspire many readers. Besides, the authors confirmed the necessity of the components of the proposed method through thorough ablation studies. The thoroughness is almost unparalleled as a conference paper. ",
    "weaknesses": "I was not able to find any major concerns. Some minor comments are written in the next section. ",
    "comments": "- I am a little unconvinced by the discussion in lines 477 to 486. I speculate that sentence embeddings learned by DiffCSE focus more on superficial information than SimCSE in order to solve replaced token detection, but the result is the opposite. Why?\n- It would be insightful to investigate the impact of the model size of the encoder. In the past few years, I have repeatedly observed that a method that works well on small models has only a marginal impact on large models. This paper will be further strengthened if the effectiveness of the proposed method is shown even when large-scale encoders are employed. ",
    "overall_score": "5 = Top-Notch: This is one of the best papers I read recently, of great interest for the (broad or narrow) sub-communities that might build on it.",
    "confidence": "5 = Positive that my evaluation is correct. I read the paper very carefully and am familiar with related work."
  }
]