[
  {
    "review_id": "67378d8e10dc9158",
    "paper_id": "ARR_2022_113",
    "reviewer": null,
    "paper_summary": "This paper focuses generally on the task of diverse decoding from conditional language generation models. Specifically, they introduce the idea of best-first search, which unlike traditional beam search involves exploring the output space using a depth-first path completion strategy. As this results in many candidate outputs, this work also utilizes path recombination to combine similar hypotheses. The recombination methods generalize previous work to account for merge a hypothesis with candidates from earlier timesteps, and then propagates any merges back through the original lattice; these changes allow for significantly more merges to occur. The authors evaluate the performance of these methods on document summarization and machine translation. ",
    "strengths": "This paper is very well-written, and clearly articulates the issues with not only beam search, but BFS approaches generally. The methods proposed are relatively novel, and show to explore significantly more of the search space than beam search, and explores in a more principal way than random sampling-based methods. The results indicate that using these methods results in significantly more diversity in the output candidates, which based on the higher oracle ROUGE scores, has the potential to improve performance given an additional re-ranking mechanism. This seems like it could be a non-trivial step forward for decoding strategies.\nThe figures are very compelling and help visualize the mechanisms that differentiate the proposed methods from previous work. Figures 11-13 in particular are fascinating visualizations of the different paths, I greatly appreciate the authors including them in the appendix. In addition, the included error analysis is helpful in identifying and motivating future work, potentially on when to reduce the aggressiveness of path merging. ",
    "weaknesses": "The paper makes several significant claims about best-first search and recombination being much more efficient than beam search, but the discussions on actual run-time are lacking. In the appendix the authors note that the best-first search code could be optimized relatively easily, but one question that doesn’t seem to be answered is: compared to the baseline approaches, how much longer does it take to generate outputs, at least as the method is implemented now?\nWhile the potential for significant improvement on quality scores is there due to the significantly higher portion of the search space explored, the authors don’t actually attempt any kind of re-ranking, which leaves an open question: are we able to actually extract the best output sequence from all the generated candidates? Did the authors try any simple re-ranking mechanisms to do this?\nFor evaluating diversity, one drawback of using distinct unigrams and bigrams is that it weights all n-grams that appear the same, which does not take into account the fact that infrequent n-grams the same. Thus, it would be good to also include Ent-n, and entropy-based metric introduced by Zhang et al (2018) that does account for this. ",
    "comments": "One previous decoding method used the combine similar outputs was to over-generate candidates, and then perform post-decoding clustering to group similar candidates together (Ippolito et al., 2019). While the methods proposed in this paper are distinct, these methods should be mentioned in the related work.\nMissing Citations: - Generating informative and diverse conversational responses via adversarial information maximization (Zhang et al., 2018) - Comparison of Diverse Decoding Methods from Conditional Language Models (Ippolito et al., 2019) ",
    "overall_score": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.",
    "confidence": "4 = Quite sure. I tried to check the important points carefully. It's unlikely, though conceivable, that I missed something that should affect my ratings."
  },
  {
    "review_id": "6b9e6be45c7620d0",
    "paper_id": "ARR_2022_113",
    "reviewer": "Nan Jiang",
    "paper_summary": "This paper proposes to use the Best-first search algorithm to improve the Beam search method for generating diverse sentences. It constructs a lattice graph along with the hypothesis recombination method to shrink the size of the graph. In experiments, the authors compare with several baselines, showing the advantage of the proposed method. ",
    "strengths": "the paper is clearly written and good to follow. the experiments and analysis are impressive. ",
    "weaknesses": "The methodology part is a little bit unclear. The author could describe clearly how the depth-first path completion really works using Figure 3. Also, I'm not sure if the ZIP algorithm is proposed by the authors and also confused about how the ZIP algorithm handles multiple sequence cases. ",
    "comments": "- Figure 2, it is not clear about \"merge target\". If possible, you may use a shorter sentence.\n- Line 113 (right column), will the lattice graph size explode? For a larger dataset, it may impossible to just get the lattice graph, am I right? How should you handle that case?\n- Algorithm 1 step 4 and 5, you may need to give the detailed steps of *isRecomb* and *doRecomb* in the appendix.\n- Line 154 left, \"including that it optimizes for the wrong objective\". Can you clearly state what objective? why the beam search algorithm is wrong? Beam search is a greedy algorithm that can recover the best output with high probability.\n- For the ZIP method, one thing unclear to me is how you combine multiple sequences by if they have different lengths of shared suffixes?\n- Line 377, is BFSZIP an existing work? If so, you need to cite their work.  - In figure 5, the y-axis label may use \"Exact Match ratio\" directly.\n- Line 409, could you cite the \"R2\" metric?\n- Appendix A, the authors state \"better model score cannot result in better hypothesis\". You'd better state clearly what idea hypothesis you want. \" a near-optimal model score\" this sentence is unclear to me, could you explain in detail?\n- In line 906, it is clear from the previous papers that Beam search results lack diversity and increase the beam size does not work. Can you simplify the paragraph? ",
    "overall_score": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  },
  {
    "review_id": "f4d5395d46a0f2f0",
    "paper_id": "ARR_2022_113",
    "reviewer": "Cunliang Kong",
    "paper_summary": "This paper proposes a novel method to explore the search space of neural text generation models. The proposed method includes two key components of a modified best-first search and a path recombination mechanism. The authors conduct experiments on text summarization and machine translation tasks. The experiment results show that the proposed method generates massive-scale candidate sentences and obtain comparable or even better metric scores. ",
    "strengths": "- The description of the proposed approach is clear and easy to follow.\n- The paper presents a well-rounded set of experiments on text summarization and machine translation.\n- The authors provide a lot of details in the appendix, which helps the reproducibility. ",
    "weaknesses": "- Although BFS is briefly introduced in Section 3, it's still uneasy to understand for people who have not studied the problem. More explanation is preferable. ",
    "comments": "- Algorithm 1, line 11: the function s(·) should accept a single argument according to line 198.\n- Figure 6: the font size is a little bit small. ",
    "overall_score": "4 = This paper represents solid work, and is of significant interest for the (broad or narrow) sub-communities that might build on it.",
    "confidence": "2 =  Willing to defend my evaluation, but it is fairly likely that I missed some details, didn't understand some central points, or can't be sure about the novelty of the work."
  }
]