[
  {
    "review_id": "90fd08bb12ac39d8",
    "paper_id": "ARR_2022_97",
    "reviewer": null,
    "paper_summary": "This paper decomposes the concept-to-text natural language generation task into three stages, (i) lexicalization, (ii) recurrent aggregation and (iii) post-editing.  The intent is to enable large pre-trained models to better leverage transfer learning.  The approach is evaluated on several datasets including Schema-Guided Dialogue, MultiWoZ and WebNLG. ",
    "strengths": "- Decomposing text generation from meaning representations into distinct stages is a constructive, and potentially impactful approach.\n- Results are presented on four datasets with varying degrees of training examples, and ablations were performed.\n- Approach appears to consistently perform better on the Missing Slot Error metric. ",
    "weaknesses": "- Several important aspects of the approach are underspecified: How are the meaning representations segmented into individual facts (Section 2.1)?  What are the inputs/outputs to each stage of the system (Sections 2.2 to 2.4)?  How are the lexicalization, aggregation and post-editing tasks performed (e.g., is this just a T5_small model)?\n- The development and exact form of the loss function (Eq 1) is unclear.\n- The label inference process seems spurious (Section 2.6).  Some examples and statistics would be helpful. ",
    "comments": "The work seems to be presented as an engineering task and provides limited insight into the fundaments of how decomposing the task help language models to consume meaning representations to generate text.  In particular, exploring the potential relationship between lexicalization and missing slot error would have made for a much stronger paper.  Also the level of specificity in Section 2 obscured the exact nature of the approach.\nThe terms s_x and v_x are not clearly defined.  Are these slots and value bindings, respectively?  If so, how are is each derived? ",
    "overall_score": "2.5 ",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  },
  {
    "review_id": "3440a8cac0acda8d",
    "paper_id": "ARR_2022_97",
    "reviewer": null,
    "paper_summary": "This paper proposed a hierarchical recurrent aggregation framework to reduce the few-shot NLG task. The proposed framework consists of three modules, lexicalization, aggregation, and post-editing, which are composed of PLMs and do not share parameters. The experimental results show that the proposed method is slightly better than the baseline under low-resource settings. ",
    "strengths": "The method performs better than the compared baseline under low-resource settings, especially for MER metrics. ",
    "weaknesses": "1. ** Poor efficiency**. The proposed method contains three different modules, each containing an unshared PLM so that the amount of parameters is three times that of the End2End method. As T5 is good at multi-task learning, I think the author should consider how to improve the performance of the model in the case of parameter sharing, rather than simply stacking multiple models. \n2. ** Time-consuming**. The proposed method requires recurrent generation so that the speed of response generation will be significantly reduced, especially when the amount of attribute-value pairs is relatively large. It should be noted that the NLG model is only a part of the dialogue system of the pipeline structure, and time efficiency also needs to be taken into consideration. \n3. ** Lack of strong baselines**. The baseline for comparison is only E2E-T5, which is a naive E2E-NLG method and may not be strong enough. Therefore, the improvement of the proposed method over a single T5 model(E2E-T5) may not be a very valuable conclusion.  I think the author should investigate and compare more few-shot NLG methods to enhance the persuasiveness of the experimental results. \n4. Lack of some additional insight into the effectiveness analysis for three modules. \n5. The innovations in this paper are more like tricks for improving metrics. ",
    "comments": "**Suggestions**: See above.\n**Questions**: In table 1, The MER indicators of +aggregation and +post-edit are both higher than 1.1, while the MER of +selection is very low. From Line.402-Line.405, the selection is selecting the one with lower MER from aggregation and post-edit. Why the best MER result is reduced to 0.14 after selection ",
    "overall_score": "2 = Borderline: This paper has some merit, but also significant flaws. It does not warrant publication at top-tier venues, but might still be a good pick for workshops.",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  }
]