[
  {
    "review_id": "ab89f54929cacdbf",
    "paper_id": "ARR_2022_11",
    "reviewer": "Fred Popowich",
    "paper_summary": "The authors propose and evaluate an approach for automatic question generation in an educational context, specifically looking at the role of summarization (whether it be human or automatic) in the process. Their approach focuses on a context in which there is no need to explicitly identify a region corresponding to the answer for a generated question (so the task is “answer-unaware”). ",
    "strengths": "The paper contains insightful empirical results showing the high value of using human summaries in the process,  but also shows that machine generated summaries can also be useful. It also contains well organized related literature. Overall, the paper is well written, and easy to understand for a large audience, with good use of examples. ",
    "weaknesses": "The methodology section could be strengthened by further justification of some of the design decisions; for example, what models were considered in addition to T5 (line 148-152).  Were there other tasks that were considered beyond the three examined (line 153-154).\nThe evaluation section could benefit from further motivation for the three experiments shown; were other considered? Were there other datasets that were considered? ",
    "comments": "How did you determine what questions you were going to ask the annotators? How is it related to what has been done in related research?\nWhat was the process for identifying annotators? Why only three annotators?  Glad to see that the \"full annotation data\" will be available, and I'm assuming that any other required data will also be available to other researchers as well. ",
    "overall_score": "3 = Good: This paper is of interest to the *ACL audience and could be published, but might not be appropriate for a top-tier publication venue. It would likely be a strong paper in a suitable workshop.",
    "confidence": "3 =  Pretty sure, but there's a chance I missed something. Although I have a good feel for this area in general, I did not carefully check the paper's details, e.g., the math or experimental design."
  }
]