[
  {
    "review_id": "e14ec3343c062669",
    "paper_id": "COLING_2020_36",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "",
    "weaknesses": "",
    "comments": "This is an interesting paper that investigates an applied NLP task of extracting the maturity of a company’s digital strategy from its earnings calls.  The paper introduces a new dataset for the task, and evaluates some existing state-of-the-art models on it.  Assuming the authors are going to release their data set (I did not see this explicitly noted in the work), this seems like a worthwhile contribution overall.\nA couple of things I felt were missing from the discussion of the data set compilation process.  First, more justification for the 17 aspects isolated in the experiment would be helpful---how did you choose those, and how do we know that they are “good choices\"?  Secondly, although the data set includes 1300 hand-annotated labels which seems like a potentially valuable data source, we are not told anything about the qualification of the labeler(s), or what interannotator agreement might be.  These last things are really critical in order to evaluate the data set as a contribution.  The fact that this information was missing was the primary reason I did not assign a higher score.\nA handful of more minor notes:  The paper is entirely missing details of the models evaluated in Section 4.2.  When you say RoBERTa performed best without language model fine-tuning, what were the details of the LM finetuning that you tried?  How many epochs and what learning rate did you use (what did you mean by a “discriminative” learning rate?)?\n“Second, we found a few conventionally asset-heavy companies from the industrials sector clustered with predominantly digital native companies from the technology sector. This indicates that some companies have made significant progress in digitally transforming their business.” \n -- This is interesting, but it would be helpful to back this claim up with specific examples or a quantitative analysis of the actual companies, to ensure this wasn’t due to clustering or extraction error.\nThere’s a typo in Table 2, recall value of 653.8",
    "overall_score": "3",
    "confidence": "3"
  }
]