[
  {
    "review_id": "6901815cd91279ba",
    "paper_id": "COLING_2020_20",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "",
    "weaknesses": "",
    "comments": "This paper aims to uncover the linguistic features that are most relevant to the task of predicting referential form (e.g., proper noun vs. pronoun use). Sets of features selected from the literature Random forest classification are used to empirically rank features. Broadly, across two analysis approaches (ranking all features and forward feature selection), animacy, grammatical role, distance in number of sentences, and whether the referent has been mentioned before in the same sentence appear to be important in several feature sets. In a 3rd experiment, several (9) new combinations of features (most important features from each set, most important features across all sets, etc) were used to classify referential form. In particular, classification with six features (selected based on their performance in the two previous experiments) led to classification accuracy of 75%, similar to the 79% accuracy achieved in a previous study using 18 features.\nThe paper is interesting and has implications both for linguistics and natural language processing. The methods are described clearly and appear to be appropriate. However, several inferences seem somewhat ad hoc and the conclusion is missing a deeper discussion surrounding the top six linguistic features. I elaborate on these issues below.\nThe results are described in a very qualitative way. The most important features are considered important because they have the highest “importance” values from the random forest analysis, but no effort is made to quantify where the differences in importance values are meaningful. In fact, it’s not exactly clear how the top six features are pulled out for the final analysis. These are clearly the same features that were highlighted in the text of the results, but it’s not clear how systematic this evaluation was. Statements such as “In all models (except kibrik), grammatical role is among the most important features.” Suggest that the authors simply selected those features which “jumped out” to them. Given that the kibrik set is the one with the highest performance and it ranks grammatical role low, an equivalent argument could be made for leaving grammatical role out of the set of most important features. I’m not saying this would be correct either, I’m just saying that whatever method they are using needs to be systematic and stated explicitly.  Similarly, despite the fact that small differences in \"importance\" are interpreted as meaningful, the difference between 75% accuracy and 79% accuracy is considered not meaningful. Perhaps it isn't but it's unclear what the basis for this assessment is.\nSince the authors suggest that linguists can use similar approaches to make theoretical contributions, it is important to show that the features being discussed are reasonable and interpretable. Currently the discussion very briefly lists the six chosen features and cites prior work which has also discussed those features. However, no interpretation is provided so it is unclear if there is any coherence between the current results and the prior literature. For example, how does plurality affect referential form in the current investigation? Similarly, what grammatical roles seem to elicit more frequent pronoun use rather than proper noun use and is this pattern consistent with what has been reported in the literature? Expanding on these and the other features would help situate the results presented here.",
    "overall_score": "4",
    "confidence": "3"
  }
]