[
  {
    "review_id": "0a225f3783ade8a3",
    "paper_id": "COLING_2020_79",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "",
    "weaknesses": "",
    "comments": "This paper is outside of my area of expertise, and my comments should be taken accordingly. It describes an improved system for word segmentation of \"Chinese\" (I guess this means Standard Written Chinese, but this isn't specified). Obviously, even small improvements on performance of word segmentation for Chinese could have significant positive impacts given the number of users of Chinese language resources. So, given that the paper reports improved performance over what it identifies as the previous state-of-the-art, it seems like a good paper for COLING. ( I have no reason to doubt that the comparison is against the actual state-of-the-art. However, I lack the expertise to know if this is the case or not.)\nSome potential issues I noted about this work are as follows: 1. I didn't see any indication as to whether the resources used in this work would be made public or not, including the new annotation guidelines. The impact of this work would be significantly greater if these resources would be made widely available, and that should be a factor in its acceptance, in my view. My low score on \"Reproducibility\" is due to this specific concern. The underlying algorithms seem clear enough, at least.\n2. I believe that the paper is, at present, aimed at a relatively small audience already familiar with previous work in this area. It would be hard for someone who is not aware of the literature on this topic, both in terms of work on Chinese and the parsing algorithms, to follow, in my view.\n3. The paper could benefit from more explicit example of the challenges that Chinese data poses for word segmentation for readers who are not familiar with this. This would, in particular, clarify the extent to which the results of this paper could be applied to other languages. ( This seems likely, especially for man Southeast Asian languages.)\n4. The paper categorizes Chinese as \"polysynthetic\", which is really bizarre. Most sources treat it as the \"opposite\" of polysynthetic, i.e., as analytic or isolating. Perhaps one can argue that the standard categorization is wrong, but no reasonable definition of polysynthetic would include Chinese.\n5. The term \"multi-grained word segmentation\" is not standard, and never appears to be defined in this paper. It would be good for it to be defined.",
    "overall_score": "4",
    "confidence": "3"
  }
]