[
  {
    "review_id": "00961b7cb1722b16",
    "paper_id": "COLING_2020_48",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "",
    "weaknesses": "",
    "comments": "This paper describes work on automatic emotion assignment to Kannada-English code-mixed tweets, with the emotions tags being ‘Happy,’ ‘Angry,’ ‘Sad,’ ‘Fear,’ ‘Disgust,’ ‘Surprise’ and ‘Multiple Emotion’. The first part of the paper outlines the procedure of corpus creation and manual emotion annotation. The second part describes experiments in automatic emotion assignment using SVMs and LSTM as machine learning techniques, based on 9 features: character n-grams, word n-grams, repetitive characters, negation words, punctuation, emoticons, capitalization, emotion words and intensifiers. Accuracy rates of 30% and 32% are reported, respectively.  The paper is relevant for COLING, and the data it is based on are quite interesting, as they illustrate a particularly challenging context for automatic text handling. It is not clear though if the corpus is/will be publicly available. The description of the manual annotation process is fairly complete, although information about the guidelines provided to the annotators would be more useful than an almost full page of examples.  The experiments are described in a fair amount of detail. However, in the results, nothing is said about how the accuracies obtained in the experiments compare to related work. In fact, related work in section 2 only covers previous studies on the automatic processing of Kannada. In other words, the study is presented in a vacuum in terms of emotion prediction studies, and unless the reader already knows about the results obtained for other languages/contexts, there is no way of situating the present study in a bigger picture. This is what the present reviewer finds to be the most negative aspect of the paper overall.  Among smaller issues, if accepted, the paper would need proofreading before publication. There are also some typos (e.g. 3,34,600 on p. 4 should probably be 334,600).",
    "overall_score": "3",
    "confidence": "3"
  }
]