[
  {
    "review_id": "74371c30c16f8cbd",
    "paper_id": "COLING_2020_39",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "",
    "weaknesses": "",
    "comments": "The authors try to propose a holistic taxonomy for text mining features with a meta-analysis method. The proposed taxonomy is helpful for understanding different types of text features, but its novelty is limited as the paper just combines and summarizes text features used in some other studies. Moreover, the investigation process has some flaws. How did you choose the 211 papers and why? With what search terms? Do you specify any other search conditions? We can imagine that there are much more papers relating to text features. For a meta-analysis study, it is crucial to choose important and representative studies in the literature (if we cannot cover all of them). Features have also been widely studied in machine learning domain, so results from the ML community could be useful as well. For example, as to the representation dimension, nominal values (e.g. topic or domain) may exist in many text mining applications. How do we process this kind of features? It would be also expected to know how the proposed taxonomy could guide the design of a text mining application.\nSection 4, as step 3 of the investigation process, should be placed under section 3.\nTypos: 1. page 5, line 1, \"136 papers\" => \"116 papers\" 2. page 6, table 1, the last line, the last cell, \"real umber\" => \"integer\"? \n3. section 4, line 8, \"The analysis shows that researchers SOLELY use ...\" 4. section 4, line 13, \"In Figure 5\" => \"In figure 6\"",
    "overall_score": "2",
    "confidence": "4"
  },
  {
    "review_id": "76b6d9e6de67d62d",
    "paper_id": "COLING_2020_39",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "of this paper is its attempt to systematically classify text mining features. Its main",
    "weaknesses": "are: 1. The paper does not provide enough motivation as to how such a taxonomy might be useful. What could it serve? For example, in the following ACL-2020 paper: https://arxiv.org/pdf/2005.04118.pdf The authors suggest a checklist with linguistic capabilities aka text mining features (e.g., negation, synonyms, semantically related terms, typos, sentence addition, etc) to test NLP models. Making a list of features regardless of application might also be too",
    "comments": "",
    "overall_score": "2",
    "confidence": "4"
  },
  {
    "review_id": "f51683b92cfd22c0",
    "paper_id": "COLING_2020_39",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "- Significant work of literature review.\n- The paper is mostly clear.",
    "weaknesses": "Despite the efforts of the authors to justify this work, I have difficulties in understanding the added value of such classification. Not that this is not useful per se, but rather because, on the one hand, it already exists (most of the classes belong to",
    "comments": "",
    "overall_score": "2",
    "confidence": "4"
  }
]