[
  {
    "review_id": "36fe80bed0946ea8",
    "paper_id": "COLING_2020_84",
    "reviewer": null,
    "paper_summary": "",
    "strengths": "--------- - Generating good distractors for multiple choice questions is a task with real-world applications that would greatly support teachers.\n- The paper is clearly written. In particular, the proposed model is quite complicated, but the general ideas are relatively well explained and the intentions behind technical decisions are articulated.",
    "weaknesses": "---------- I was somewhat underwhelmed by the evaluation. While the numbers show that the proposed method outperforms the state of the art, I did not get a good sense what the generated distractors really look like or whether they would be useful in the creation of actual exams.\n- The evaluation does not directly assess the aspects of distractor generation that the authors want to improve on. In the introduction the authors say that they are specifically interested in generating distractors that are incorrect, but plausible. The proposed method is designed to improve those aspects. However, neither the automatic evaluation nor the human evaluation tries to directly assess those aspects.\n- While the evaluation compares the proposed approach to a number of other recently proposed approaches to distractor generation, how exactly the proposed model differs from these prior approaches could be explained more explicitly and with a bit more detail.\n- I wonder about the variety of distractors that can be generated by this approach in comparison to the variety among human generated distractors. It seems that the proposed approach would always generate distractors which draw on information from other parts of the text passage. However, there may be questions where the answer as well as any potential distractors do not so much rely on specific parts of the reading passage. For example, questions that ask for the meaning of words or phrases may rely more on the test takers prior knowledge. Or the distractors for question 2 from Figure 1, which asks for a title, seem to not be tied to closely to a specific part of the given passage either.\n- I wish the paper would give more examples (than just one) of generated distractors. And I wish there were some examples of distractors generated by some of the prior approaches for comparison.\nOther questions and",
    "comments": "",
    "overall_score": "4",
    "confidence": "3"
  }
]